# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap "homebrew/core"
tap 'homebrew/bundle'
tap "domt4/autoupdate"

# Binaries
brew "act"
brew 'ffmpeg'
brew 'coreutils'
brew "readline"
brew "sqlite"
brew "openjdk"
brew "ant"
brew "cask"
brew "docker"
brew "doctl"
brew "doxygen"
brew "gh"
brew "git"
brew "git-extras"
brew "git-flow"
brew "git-lfs"
brew "glfw"
brew "gradle"
brew "gsl"
brew "jenv"
brew "mariadb"
brew "maven"
brew "mercurial"
brew "mosquitto"
brew "nvm"
brew "pyenv"
brew "python@3.10"
brew "s3cmd"
brew "swagger-codegen"
brew "uncrustify"
brew "xpdf"
brew "yarn"
brew "zlib"
brew "zsh-syntax-highlighting"
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'stripe/stripe-mock/stripe-mock'
brew 'svn' # Needed to install fonts

# Apps
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "microsoft-office"
cask "beekeeper-studio"
cask "discord"
cask "docker"
cask "flutter"
cask "google-cloud-sdk"
cask "home-assistant"
cask "iterm2"
cask "mqttx"
cask "notion"
cask "openscad"
cask "packetsender"
cask "postman"
cask "prusaslicer"
cask "synology-drive"
cask "tor-browser"
cask "tunnelblick"
cask "vincelwt-chatgpt"
cask '1password'
cask 'figma'
cask 'google-chrome'
cask 'pastebot'
cask 'ray'
cask 'raycast'
cask 'readdle-spark'
cask 'screenflow'
cask 'slack'
cask 'tableplus'
cask 'the-unarchiver'
cask 'transmit'
cask 'tunnelbear'
cask 'tuple'
cask 'visual-studio-code'
cask 'zoom'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-fira-code'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
