# Taps
tap 'buo/cask-upgrade'
tap 'homebrew/autoupdate'
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'romkatv/powerlevel10k'
tap 'stripe/stripe-cli'
tap 'stripe/stripe-mock'

# Binaries
brew 'act'
brew 'ant'
brew 'cask'
brew 'coreutils'
brew 'doctl'
brew 'doxygen'
brew 'ffmpeg'
brew 'gh'
brew 'git-extras'
brew 'git-flow'
brew 'git-lfs'
brew 'git'
brew 'glfw'
brew 'gnupg'
brew 'gpg2'
brew 'gradle'
brew 'gsl'
brew 'jenv'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mariadb'
brew 'mas' # Mac App Store manager
brew 'maven'
brew 'mercurial'
brew 'mosquitto'
brew 'nvm'
brew 'openjdk'
brew 'pinentry-mac'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'pyenv'
brew 'python@3.10'
brew 'readline'
brew 'romkatv/powerlevel10k/powerlevel10k'
brew 's3cmd'
brew 'sqlite'
brew 'stripe/stripe-cli/stripe'
brew 'stripe/stripe-mock/stripe-mock'
brew 'svn' # Needed to install fonts
brew 'swagger-codegen'
brew 'uncrustify'
brew 'xpdf'
brew 'yarn'
brew 'zlib'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'koekeishiya/formulae/yabai'

# Apps
cask '1password'
cask 'adobe-acrobat-reader'
cask 'affinity-designer'
cask 'affinity-photo'
cask 'affinity-publisher'
cask 'app-cleaner'
cask 'beekeeper-studio'
cask 'deepl'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'figma'
cask 'flutter'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'google-drive'
cask 'home-assistant'
cask 'iterm2'
cask 'kap'
cask 'logi-options-plus'
cask 'microsoft-office'
cask 'mqttx'
cask 'ngrok'
cask 'notion'
cask 'openscad'
cask 'packetsender'
cask 'pastebot'
cask 'portfolioperformance'
cask 'postman'
cask 'prusaslicer'
cask 'ray'
cask 'raycast'
cask 'readdle-spark'
cask 'screenflow'
cask 'slack'
cask 'sourcetrail'
cask 'spark'
cask 'spotify'
cask 'steam'
cask 'surfshark'
cask 'teamviewer'
cask 'synology-drive'
cask 'tableplus'
cask 'the-unarchiver'
cask 'tor-browser'
cask 'transmit'
cask 'tunnelbear'
cask 'tunnelblick'
cask 'tuple'
cask 'vincelwt-chatgpt'
cask 'visual-studio-code'
cask 'whatsapp-alpha'
cask 'zoom'

# Fonts
cask 'font-fira-code'
cask 'font-fira-mono-nerd-font'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'AusweisApp2', id: 948660805
